testEdo/Old/combustor_orig/combustor_mesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            patch;
        nFaces          288;
        startFace       12504;
    }
    inlet
    {
        type            patch;
        nFaces          372;
        startFace       12792;
    }
    outlet
    {
        type            patch;
        nFaces          372;
        startFace       13164;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          372;
        startFace       13536;
    }
    upperWall
    {
        type            patch;
        nFaces          372;
        startFace       13908;
    }
)

// ************************************************************************* //
